uhnp/src/DataProcessors/тн_АктСписанияСырья/тн_АктСписанияСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_АктСписанияСырья</name>
  <comment>//Качикина 21.01.2026 Выполнение задач №000056363 </comment>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/тн_СведенияОПодписяхВПриказах/тн_СведенияОПодписяхВПриказах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_СведенияОПодписяхВПриказах</name>
  <comment>Выполнение задач №000038912</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Приказ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ФИОвПодписи</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриказНаЭкспорт</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ФИОВПодписиНаЭкспорт</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДолжностьНаЭкспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПодписи</name>
    <type>
      <types>EnumRef.тн_ВидыПодписейПоПриказам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>//Качикина 21.01.2026 Выполнение задач №000056363 </comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/тн_ВидыПодписейПоПриказам/тн_ВидыПодписейПоПриказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ВидыПодписейПоПриказам</name>
  <comment>Выполнение задач №000038912</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>Кладовщик</name>
  </enumValues>
  <enumValues>
    <name>ПредседательКомиссииПоСписаниюМатериалов</name>
    <comment>//Качикина 21.01.2026 Выполнение задач №000056363</comment>
  </enumValues>
  <enumValues>
    <name>ЧленКомиссииПоСписаниюМатериалов</name>
    <comment>//Качикина 21.01.2026 Выполнение задач №000056363</comment>
  </enumValues>
  <enumValues>
    <name>ПредседательКомиссииПоСписаниюПрочихТМЦ</name>
    <comment>//Качикина 21.01.2026 Выполнение задач №000056370</comment>
  </enumValues>
  <enumValues>
    <name>ЧленКомиссииПоСписаниюПрочихТМЦ</name>
    <comment>//Качикина 21.01.2026 Выполнение задач №000056370</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/РазделыУчетаСебестоимостиТоваров/РазделыУчетаСебестоимостиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчетаСебестоимостиТоваров</name>
  <enumValues>
    <name>ВыпускПродукции</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработку</name>
    <comment>Материалы, принятые в переработку</comment>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуКОформлениюСписания</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуПереданныеПартнерам</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>НеотфактурованныеПоставки</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СобственныеТоварыВПути</name>
  </enumValues>
  <enumValues>
    <name>СобственныеТоварыПереданныеПартнерам</name>
  </enumValues>
  <enumValues>
    <name>ТоварыВПути</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНаСкладах</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНаХраненииСПравомПродажи</name>
    <comment>Товары, принятые на ответственное хранение с правом продажи</comment>
  </enumValues>
  <enumValues>
    <name>ТоварыНаХраненииСПравомПродажиКОформлениюСписания</name>
    <comment>Товары, принятые на ответственное хранение, к оформлению списания</comment>
  </enumValues>
  <enumValues>
    <name>ТоварыНаХраненииСПравомПродажиПереданныеПартнерам</name>
  </enumValues>
  <enumValues>
    <name>ТоварыПереданныеНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ТоварыПереданныеНаКомиссиюВПути</name>
    <comment>Товары, переданные на комиссию в пути</comment>
  </enumValues>
  <enumValues>
    <name>ТоварыПереданныеПереработчику</name>
  </enumValues>
  <enumValues>
    <name>ТоварыПринятыеНаКомиссию</name>
    <comment>Товары, принятые на комиссию</comment>
  </enumValues>
  <enumValues>
    <name>ТоварыПринятыеНаКомиссиюВПути</name>
    <comment>Товары, принятые на комиссию в пути</comment>
  </enumValues>
  <enumValues>
    <name>ТоварыПринятыеНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ТоварыПринятыеНаОтветхранениеКОформлениюСписания</name>
  </enumValues>
  <enumValues>
    <name>ТоварыПринятыеНаОтветхранениеПереданныеПартнерам</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыЗаписейПартий/ТипыЗаписейПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаписейПартий</name>
  <enumValues>
    <name>БазаДопРасходыРегл</name>
  </enumValues>
  <enumValues>
    <name>БазаДопРасходыУпр</name>
  </enumValues>
  <enumValues>
    <name>БазаРегл</name>
  </enumValues>
  <enumValues>
    <name>БазаУпр</name>
  </enumValues>
  <enumValues>
    <name>Взносы</name>
  </enumValues>
  <enumValues>
    <name>ВключениеИсключениеНДСВСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ВключениеНДСВСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВозвратБезДокументаИсточника</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаДругойСклад</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПрошлыхПериодов</name>
  </enumValues>
  <enumValues>
    <name>Выпуск</name>
  </enumValues>
  <enumValues>
    <name>ВыпускБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>Дополнение</name>
  </enumValues>
  <enumValues>
    <name>ДополнениеПрошлыйПериод</name>
  </enumValues>
  <enumValues>
    <name>ДополнениеРасчетПартий</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходы</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыБезПартии</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыДляРаспределенияРегл</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыДляРаспределенияУпр</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыРегл</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыСПартией</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыУпр</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеПеремещенияПрошлогоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеПрошлогоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеТекущегоПериода</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретенияПрошлогоПериода</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеализации</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСтоимости</name>
  </enumValues>
  <enumValues>
    <name>МаршрутныйЛист</name>
  </enumValues>
  <enumValues>
    <name>НЗП</name>
  </enumValues>
  <enumValues>
    <name>Остаток</name>
  </enumValues>
  <enumValues>
    <name>ОстатокБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ОстатокДляРаспределения</name>
  </enumValues>
  <enumValues>
    <name>ОстатокНЗП</name>
  </enumValues>
  <enumValues>
    <name>ОстатокСгруппированный</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеВСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеВСтоимостиНаПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеВСтоимостиНаПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДавальцу</name>
  </enumValues>
  <enumValues>
    <name>ПартииВПути</name>
  </enumValues>
  <enumValues>
    <name>ПартииДляРаспределения</name>
  </enumValues>
  <enumValues>
    <name>Партия</name>
  </enumValues>
  <enumValues>
    <name>ПартияБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПартияСгруппированная</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеАвто</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОбособленно</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСгруппированное</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоварыВПути</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеУпр</name>
  </enumValues>
  <enumValues>
    <name>Переработка</name>
  </enumValues>
  <enumValues>
    <name>ПоБазеБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПоВсемПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоВсемЭтапам</name>
  </enumValues>
  <enumValues>
    <name>ПодразделенияДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПодразделенияПоБазе</name>
  </enumValues>
  <enumValues>
    <name>ПолуфабрикатДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>Потребление</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеАвто</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеТоварыВПути</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапам</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПодразделений</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияДавальца</name>
  </enumValues>
  <enumValues>
    <name>Прошлое</name>
  </enumValues>
  <enumValues>
    <name>Распределение</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеПоВыбывшимТоварам</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеПоПравилам</name>
  </enumValues>
  <enumValues>
    <name>Расчетное</name>
  </enumValues>
  <enumValues>
    <name>СлужебноеВключитьУправленческийУчетПоПравиламМФУ</name>
    <comment>Изменение константы ВестиУправленческийУчетОрганизаций</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеВключитьУчетПоВидамЗапасов</name>
    <comment>Включение учета себестоимости по видам запасов</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеВключитьУчетПоНазначениям</name>
    <comment>Изменение константы УчитыватьСебестоимостьТоваровПоНазначениям</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеДозаполнениеАналитикиУчетаПартийНДСиУСН2_4</name>
    <comment>Заполнение ключа аналитики учета партий для партий производства</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеИзменениеМетодаОценкиСтоимости</name>
    <comment>Изменение реквизита МетодОценкиСтоимостиТоваров в учетной политике организации</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеИзменениеПартнераВАналитикеУчетаНоменклатуры</name>
    <comment>Замена партнера на договор партнера в ключе аналитики учета номенклатуры</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеКорректировкаОстатковПартийПрочихРасходов</name>
  </enumValues>
  <enumValues>
    <name>СлужебноеОтключитьУправленческийУчетПоПравиламМФУ</name>
    <comment>Изменение константы ВестиУправленческийУчетОрганизаций</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеОтключитьУчетПоНазначениям</name>
    <comment>Изменение константы УчитыватьСебестоимостьТоваровПоНазначениям</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеПереходНаПартионныйУчет22</name>
    <comment>Корректировки при включении партионного учета версии 2.2</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеПереходНаРегистрДетализацияСебестоимостиТоваров</name>
    <comment>Переход на регистр ДетализацияСебестоимостиТоваров</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНаДругиеПартии</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеОстаткаБезПартии</name>
  </enumValues>
  <enumValues>
    <name>СписанияНаВыпуск</name>
  </enumValues>
  <enumValues>
    <name>СписанияНаВыпускПостатейные</name>
  </enumValues>
  <enumValues>
    <name>СписанияНаВыпускСторноПрошлогоПериода</name>
  </enumValues>
  <enumValues>
    <name>Сторно</name>
  </enumValues>
  <enumValues>
    <name>СторноВозврата</name>
  </enumValues>
  <enumValues>
    <name>СторноВозвратаПрошлыхПериодов</name>
  </enumValues>
  <enumValues>
    <name>СторноВозвратНаДругойСклад</name>
  </enumValues>
  <enumValues>
    <name>СторноДопРасходов</name>
  </enumValues>
  <enumValues>
    <name>СторноПотребления</name>
  </enumValues>
  <enumValues>
    <name>СторноСписанияНаВыпуск</name>
  </enumValues>
  <enumValues>
    <name>СторноСписанияНаДругиеПартии</name>
  </enumValues>
  <enumValues>
    <name>СторноСписанияОстаткаБезПартии</name>
  </enumValues>
  <enumValues>
    <name>Трудозатраты</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/КлючиАналитикиУчетаНоменклатуры/КлючиАналитикиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиУчетаНоменклатуры</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМестаХранения</name>
    <type>
      <types>EnumRef.ТипыМестХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяТерритория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_АктСписанияСырья/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Значения по-умолчанию 
	Если СтатьиКалькуляции.Количество()=0 Тогда 
		СтатьиКалькуляции.Добавить(Справочники.СтатьиКалькуляции.тн_ВспомогательноеСырье);
		СтатьиКалькуляции.Добавить(Справочники.СтатьиКалькуляции.тн_ОсновноеСырье); 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПричинаСписания) Тогда 
		ПричинаСписания = "Выпуск ГП";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Отказ = Ложь;
	
	//1. проверяем заполненность параметров 
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен параметр ""Период""");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен параметр ""Организация""");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен параметр ""Подразделение""");
		Отказ = Истина;
	КонецЕсли;     
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//2. Заполнение макета
	СформироватьПечатнуюФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьПечатнуюФормуНаСервере()
	
	ТабличныйДокументРезультат.Очистить();
	ТабличныйДокументРезультат.Автомасштаб = Истина;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОсновнойМакет = ОбработкаОбъект.ПолучитьМакет("Макет"); 
	
	КонецПериода = Период.ДатаОкончания;
	
	//данные документа тн_ПодписиВПриказах
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация", Организация); 
	
	СписокВидовПодписей = Новый СписокЗначений;
	СписокВидовПодписей.Добавить(Перечисления.тн_ВидыПодписейПоПриказам.Руководитель);
	СписокВидовПодписей.Добавить(Перечисления.тн_ВидыПодписейПоПриказам.ПредседательКомиссииПоСписаниюМатериалов);
	СписокВидовПодписей.Добавить(Перечисления.тн_ВидыПодписейПоПриказам.ЧленКомиссииПоСписаниюМатериалов);
	ПараметрыОтбора.Вставить("ВидПодписи", СписокВидовПодписей);
	
	//получаем с учетом подразделения; если не нашли по подразделению, то не учитываем его
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.Добавить(Справочники.СтруктураПредприятия.ПустаяСсылка());
	СписокПодразделений.Добавить(Подразделение);
	ПараметрыОтбора.Вставить("Подразделение", СписокПодразделений);
	
	Данные_ПодписиВПриказах = РегистрыСведений.тн_СведенияОПодписяхВПриказах.НастройкиСведенийОПодписяхВПриказах(КонецПериода, ПараметрыОтбора);
	
	//данные для таблицы
	ТЗАктаСписания	= ДанныеАктаСписания();
	
	//ШАПКА
	ОбластьШапка = ОсновнойМакет.ПолучитьОбласть("Шапка");
	
	СведенияОбОрганизации	= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, КонецПериода);
	ОбластьШапка.Параметры.ПолноеПредставлениеОрганизации = СведенияОбОрганизации.ПолноеНаименование + Символы.ПС
									+ " ИНН: " + СведенияОбОрганизации.ИНН + ", КПП: " + СведенияОбОрганизации.КПП + " " + Символы.ПС
									+ СведенияОбОрганизации.ЮридическийАдрес;
	
	ОбластьШапка.Параметры.Дата = Формат(КонецПериода, "ДЛФ=DD");
	ОбластьШапка.Параметры.ПодразделениеОрганизации = Подразделение;
	ОбластьШапка.Параметры.ПериодФормирования = НРег(Формат(КонецПериода,"ДФ=ММММ")) +" " +Формат(КонецПериода,"ДФ=гггг") + " г. ";
	
		
    // ДиректорДолжность, Директор - Руководитель
	Данные_Руководитель = Данные_ПодписиВПриказах.НайтиСтроки(Новый Структура("ВидПодписи, Подразделение",
									Перечисления.тн_ВидыПодписейПоПриказам.Руководитель, Подразделение));
	Если Данные_Руководитель.Количество() = 0 Тогда
		Данные_Руководитель = Данные_ПодписиВПриказах.НайтиСтроки(Новый Структура("ВидПодписи, Подразделение",
							Перечисления.тн_ВидыПодписейПоПриказам.Руководитель, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	КонецЕсли; 
	Если Данные_Руководитель.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по виду подписи ""Руководитель""!");	
	Иначе
		ОбластьШапка.Параметры.ДиректорДолжность = Данные_Руководитель[0].Должность;
		ОбластьШапка.Параметры.Директор = Данные_Руководитель[0].ФИОвПодписи;	
	КонецЕсли;    
	
	// ФИОПредседателя, ФИОЧленаКомиссии, ПриказТвП - ПредседательКомиссииПоСписаниюМатериалов 
	Данные_ПредседательКомиссии = Данные_ПодписиВПриказах.НайтиСтроки(Новый Структура("ВидПодписи, Подразделение",
								Перечисления.тн_ВидыПодписейПоПриказам.ПредседательКомиссииПоСписаниюМатериалов, Подразделение));
	Если Данные_ПредседательКомиссии.Количество() = 0 Тогда
		Данные_ПредседательКомиссии = Данные_ПодписиВПриказах.НайтиСтроки(Новый Структура("ВидПодписи, Подразделение",
								Перечисления.тн_ВидыПодписейПоПриказам.ПредседательКомиссииПоСписаниюМатериалов, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	КонецЕсли;
	Если Данные_ПредседательКомиссии.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по виду подписи ""Председатель комиссии по списанию материалов""!");	
	Иначе
		ОбластьШапка.Параметры.ФИОПредседателя = Данные_ПредседательКомиссии[0].ФИОвПодписи; 
		ОбластьШапка.Параметры.ПриказТвП = Данные_ПредседательКомиссии[0].Приказ;
	КонецЕсли;  
	
	// ФИОЧленаКомиссии - ЧленКомиссииПоСписаниюМатериалов - выводим всех через запятую
	Данные_ЧленыКомиссии = Данные_ПодписиВПриказах.НайтиСтроки(Новый Структура("ВидПодписи, Подразделение",
								Перечисления.тн_ВидыПодписейПоПриказам.ЧленКомиссииПоСписаниюМатериалов, Подразделение));
	Если Данные_ЧленыКомиссии.Количество() = 0 Тогда
		Данные_ЧленыКомиссии = Данные_ПодписиВПриказах.НайтиСтроки(Новый Структура("ВидПодписи, Подразделение",
								Перечисления.тн_ВидыПодписейПоПриказам.ЧленКомиссииПоСписаниюМатериалов, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	КонецЕсли;
	Если Данные_ЧленыКомиссии.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по виду подписи ""Член комиссии по списанию материалов""!");	
	Иначе  
		ФИОЧленаКомиссии = "";
		Для Каждого ЧленКомиссии Из Данные_ЧленыКомиссии Цикл 
			ФИОЧленаКомиссии = ФИОЧленаКомиссии  + ЧленКомиссии.ФИОвПодписи + ", "; 
		КонецЦикла;
		ОбластьШапка.Параметры.ФИОЧленаКомиссии = Лев(ФИОЧленаКомиссии,СтрДлина(ФИОЧленаКомиссии)-2); 
	КонецЕсли;
	
	ТабличныйДокументРезультат.Вывести(ОбластьШапка);
	
	//СТРОКА
	ОбластьСтрока = ОсновнойМакет.ПолучитьОбласть("Строка");
	 
	СуммаИтого		= 0;
	НомерПоПорядку	= 1;
	Для Каждого СтрокаТЗ Из ТЗАктаСписания Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЗ); 
		ОбластьСтрока.Параметры.Номер	= НомерПоПорядку;
		ОбластьСтрока.Параметры.Причина = ПричинаСписания;
		
		ТабличныйДокументРезультат.Вывести(ОбластьСтрока); 
		
		СуммаИтого		= СуммаИтого + СтрокаТЗ.Сумма; 
		НомерПоПорядку	= НомерПоПорядку + 1;
		
	КонецЦикла;
	
	//СТРОКА ИТОГО
	Область = ОсновнойМакет.ПолучитьОбласть("СтрокаИтого");	
	Область.Параметры.СуммаИтого = Формат(СуммаИтого, "ЧДЦ=2");
	ТабличныйДокументРезультат.Вывести(Область);	
	
	//ПРЕДСЕДАТЕЛЬ КОМИССИИ 
	Область = ОсновнойМакет.ПолучитьОбласть("ПредседательКомиссии");	
	Если Данные_ПредседательКомиссии.Количество() > 0 Тогда
		Область.Параметры.ФИОПредседателя = Данные_ПредседательКомиссии[0].ФИОвПодписи;
		Область.Параметры.ДолжностьПредседателя = Данные_ПредседательКомиссии[0].Должность;		
	КонецЕсли;
	ТабличныйДокументРезультат.Вывести(Область);	
	
	//ЧЛЕНЫ КОМИССИИ
	Область = ОсновнойМакет.ПолучитьОбласть("ЧленыКомиссии");	
	ЭтоПервыйЧК = Истина; 
	Если Данные_ЧленыКомиссии.Количество()=0 Тогда
		ТабличныйДокументРезультат.Вывести(Область);
	Иначе	
		Для Каждого ЧК Из Данные_ЧленыКомиссии Цикл 	
			Область.Параметры.ЗаголовокЧленыКомиссии = ?(ЭтоПервыйЧК,"Члены комиссии:","");
			Область.Параметры.ФИОЧленаКомиссии = ЧК.ФИОвПодписи;
			Область.Параметры.ДолжностьЧленаКомиссии = ЧК.Должность;
			ТабличныйДокументРезультат.Вывести(Область); 
			ЭтоПервыйЧК = Ложь;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеАктаСписания()
	
	Запрос =  Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	СебестоимостьТоваров.СтатьяКалькуляции КАК CтатьяЗатрат,
	               |	СУММА(СебестоимостьТоваров.Количество) КАК Количество,
				   //НАЧАЛО Качикина 09.04.2026 Выполнение задач №000057328
	               //|	СУММА(СебестоимостьТоваров.СтоимостьРегл) КАК Сумма
				   |	СУММА(СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл) КАК Сумма
				   //КОНЕЦ Качикина 09.04.2026 Выполнение задач №000057328
	               |ПОМЕСТИТЬ втСебестоимостьТоваров
	               |ИЗ
	               |	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	               |ГДЕ
	               |	СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода  
				   |	И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	               |	И СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
				   |	И СебестоимостьТоваров.Организация = &Организация
	               |	И СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	               |	И СебестоимостьТоваров.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск) 
				   |	//ОТБОР_СтатьяКалькуляции
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	               |	СебестоимостьТоваров.СтатьяКалькуляции
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(КлючиАналитикиУчетаНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
				   //НАЧАЛО Качикина 20.05.2026 Выполнение задач №000057717
				   //|	втСебестоимостьТоваров.Количество КАК Количество,
				   |ВЫБОР
				   |	КОГДА ЕСТЬNULL(СправочникНоменклатура.тн_КоэффициентБазовойЕдиницыИзмерения,0) = 0
				   |		ТОГДА 0
				   |	ИНАЧЕ ВЫРАЗИТЬ(втСебестоимостьТоваров.Количество/ЕСТЬNULL(СправочникНоменклатура.тн_КоэффициентБазовойЕдиницыИзмерения,0) КАК ЧИСЛО(15,2)) 
				   |КОНЕЦ КАК Количество,	
				   //КОНЕЦ Качикина 20.05.2026 Выполнение задач №000057717
	               |	втСебестоимостьТоваров.Сумма КАК Сумма,
	               |	втСебестоимостьТоваров.CтатьяЗатрат КАК CтатьяЗатрат
	               |ИЗ
	               |	втСебестоимостьТоваров КАК втСебестоимостьТоваров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
				    //НАЧАЛО Качикина 20.05.2026 Выполнение задач №000057717
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
				   |				ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
				   //КОНЕЦ Качикина 20.05.2026 Выполнение задач №000057717
				   |		ПО втСебестоимостьТоваров.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка 
				   |			И (КлючиАналитикиУчетаНоменклатуры.Подразделение = &Подразделение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втСебестоимостьТоваров";
		
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Подразделение", Подразделение); 
	Если ЗначениеЗаполнено(СтатьиКалькуляции) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ОТБОР_СтатьяКалькуляции","И СебестоимостьТоваров.СтатьяКалькуляции В (&СтатьиКалькуляции)");	
		Запрос.УстановитьПараметр("СтатьиКалькуляции", СтатьиКалькуляции);
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ; 
	
КонецФункции

#КонецОбласти
